results/routeA/initialization_check/A-Ra1e4-fine/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
25600
(
-0.0004401408450704225
-0.0004401408450704225
-0.0004401408450704225
-0.0004401408450704225
-0.0004401408450704225
-0.0004401408450704225
-0.0004401408450704225
-0.0004401408450704225
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.0004399207746478873
-0.001319762323943662
-0.002199603873239437
-0.003079445422535211
-0.003959286971830986
-0.004839128521126761
-0.005718970070422535
-0.00659881161971831
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.0004403609154929577
-0.001321082746478873
-0.002201804577464789
-0.003082526408450704
-0.00396324823943662
-0.004843970070422535
-0.005724691901408451
-0.006605413732394367
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform -0.1408450704225352;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
