results/routeA/initialization_check/A-Ra1e4-fine/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
25600
(
-5.421010862427522e-20
5.421010862427522e-20
5.421010862427522e-20
-5.421010862427522e-20
-1.084202172485504e-19
1.084202172485504e-19
2.168404344971009e-19
-5.421010862427522e-20
...
)
;

boundaryField
{
    hotWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
160
(
5.421010862427522e-20
0
-4.336808689942018e-19
4.336808689942018e-19
8.673617379884035e-19
8.673617379884035e-19
0
8.673617379884035e-19
...
)
;
    }
    coldWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
160
(
5.421010862427522e-20
0
-8.673617379884035e-19
0
0
0
-1.734723475976807e-18
-1.734723475976807e-18
...
)
;
    }
    bottomWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    topWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
160
(
-2.775557561562891e-17
-5.551115123125783e-17
-5.551115123125783e-17
-2.775557561562891e-17
-5.551115123125783e-17
0
0
0
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
